import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;
import java.util.ArrayList;
import java.util.List;

public class Homework {

// Используйте класс Student из урока 60 (см. Student.java).
// Создайте список учеников с баллами.
// Попросите пользователя ввести минимальный проходной балл.
// Выведите список учеников согласно следующим условиям:
//   каждый ученик выведен в отдельной строке
//   сумма баллов каждого ученика выше минимального проходного
//   ученики отсортированы по убыванию среднего балла
//   в списке не больше 10 учеников (извините, конкурс)
// Для обработки и вывода результата используйте потоки (Stream).


}
